{
  "job_id": "4360035173",
  "job_url": "https://www.linkedin.com/jobs/view/4360035173",
  "job_title": "Software Engineer, Safari Extensions",
  "company_name": "Apple",
  "company_url": "https://www.linkedin.com/company/apple",
  "location": "San Diego, CA",
  "time_posted": "3 weeks ago",
  "num_applicants": "53 applicants",
  "salary_range": "$139,500.00/yr - $258,100.00/yr",
  "job_description": "SummaryWe're looking for an engineer to help us craft the future direction of extensions for web browsers, with a focus on user privacy, user experience, and developer experience. The team builds on the industry-leading WebKit engine and Apple's frameworks to deliver a set of APIs and tools that developers can use to build compelling extensions that enhance the user experience in Safari. Your impact will extend beyond Safari, as you help drive the iOS and macOS extensions platforms forwardDescriptionIn this role, you’ll help build the foundations of the Safari Extensions platform! You’ll be responsible for making the developer experience fast, fun, and accessible. You’ll implement new APIs and tools and improve the architecture, security, and privacy of existing ones. You’ll be involved from beginning to end — brainstorming, prototyping, coding, debugging, shipping, and addressing developer and user feedback. You’ll collaborate with the WebKit team, other iOS and macOS application and framework teams, the Developer Tools teams, the Security and Privacy teams, and Apple’s Human Interface group. We want you to be imaginative and self-motivated, and care deeply about both the user and the developer experience!Minimum QualificationsThorough understanding of Swift, Objective-C, C++, or CStrong object-oriented programming experienceExcellent debugging and analytical skillsPreferred QualificationsAbility to thrive in a highly collaborative environment focused on learningCreativity and enthusiasm for improving developer experienceExcellent communication skillsPay & BenefitsAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $139,500 and $258,100, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.Apple is an equal opportunity employer that is committed to inclusion and diversity. We seek to promote equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant.Apple accepts applications to this posting on an ongoing basis.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
  "job_description_raw_html": "\n<section class='show-more-less-html' data-max-lines='5'>\n<div class='show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden'>\n<strong>Summary<br/><br/></strong>We're looking for an engineer to help us craft the future direction of extensions for web browsers, with a focus on user privacy, user experience, and developer experience. The team builds on the industry-leading WebKit engine and Apple\"s frameworks to deliver a set of APIs and tools that developers can use to build compelling extensions that enhance the user experience in Safari. Your impact will extend beyond Safari, as you help drive the iOS and macOS extensions platforms forward<br/><br/><strong>Description<br/><br/></strong>In this role, you’ll help build the foundations of the Safari Extensions platform! You’ll be responsible for making the developer experience fast, fun, and accessible. You’ll implement new APIs and tools and improve the architecture, security, and privacy of existing ones. You’ll be involved from beginning to end — brainstorming, prototyping, coding, debugging, shipping, and addressing developer and user feedback. You’ll collaborate with the WebKit team, other iOS and macOS application and framework teams, the Developer Tools teams, the Security and Privacy teams, and Apple’s Human Interface group. We want you to be imaginative and self-motivated, and care deeply about both the user and the developer experience!<br/><br/><strong>Minimum Qualifications<br/><br/></strong><ul><li>Thorough understanding of Swift, Objective-C, C++, or C</li><li>Strong object-oriented programming experience</li><li>Excellent debugging and analytical skills<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Ability to thrive in a highly collaborative environment focused on learning</li><li>Creativity and enthusiasm for improving developer experience</li><li>Excellent communication skills<br/><br/></li></ul><strong>Pay &amp; Benefits<br/><br/></strong>At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $139,500 and $258,100, and your base pay will depend on your skills, qualifications, experience, and location.<br/><br/>Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.<br/><br/>Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.<br/><br/>Apple is an equal opportunity employer that is committed to inclusion and diversity. We seek to promote equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant.<br/><br/>Apple accepts applications to this posting on an ongoing basis.<br/><br/>\n</div>\n<button aria-expanded='false' aria-label='Show mor' class='show-more-less-html__button show-more-less-button show-more-less-html__button--more ml-0.5' data-tracking-control-name='public_jobs_show-more-html-btn'>\n<!-- -->\n        \n            Show more\n          \n\n          <icon class='show-more-less-html__button-icon show-more-less-button-icon' data-delayed-url='https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo'></icon>\n</button>\n<button aria-expanded='true' aria-label='Show less' class='show-more-less-html__button show-more-less-button show-more-less-html__button--less ml-0.5' data-tracking-control-name='public_jobs_show-less-html-btn'>\n<!-- -->\n        \n            Show less\n          \n\n          <icon class='show-more-less-html__button-icon show-more-less-button-icon' data-delayed-url='https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg'></icon>\n</button>\n<!-- --> </section>\n",
  "company_logo_url": "https://media.licdn.com/dms/image/v2/C560BAQHdAaarsO-eyA/company-logo_100_100/company-logo_100_100/0/1630637844948/apple_logo?e=2147483647&v=beta&t=p0JNmv2WB0EMMQgvzl9R8TaXgzEaDraGS4MWR0IawjQ",
  "seniority_level": "Entry level",
  "employment_type": "Full-time",
  "job_function": "Engineering and Information Technology",
  "industries": "Computers and Electronics Manufacturing",
  "easy_apply": false,
  "apply_url": "https://jobs.apple.com/en-us/details/200634673?board_id=17682"
}
